# X = 5
#
# print('Hello, world')
# if X >= 4:
#      print('Good')

x, y = 10, 15
# Сравнение чисел(Int)
if x < y:
    print('Хорошо')
if x < y and y >= 0:
    print('Превосходно')
if x < y and (y > 0 or y > x):
    print('Замечательно')
if 9 < x and y > 14:
    print('Шикарно')
     # Ошибка допущена специально =)
if x > 1000 and y == 15:
    print('Неверная строка#')
print('-------')
# Сравнение строк(String)
if '12' < '123':
    print('Так и есть')
# Сравнение списков(List)
if [1, 4, 5] < [2, 3 , 6]:
    print('Правильно')
# Нельзя сравнивать разные типы данных
if [3, 2 ,2] > '421':
    print('Так нельзя')
if 421 < '521':
    print('И так тоже')